q61org/CH559_EasyUSBHost/main.c
#include "sdcc_keywords.h"

typedef unsigned char *PUINT8;
typedef unsigned char __xdata *PUINT8X;
typedef const unsigned char __code *PUINT8C;
typedef unsigned char __xdata UINT8X;
typedef unsigned char  __data             UINT8D;

#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include "CH559.h"
#include "util.h"
#include "USBHost.h"
#include "uart0.h"
#include "uart1.h"
#include "ringbuf.h"
#include "udev_hid.h"
#include "udev_hub.h"
#include "gamepad.h"


#define VERSION_BYTE 0x04
#define VERSION_STR  "v20221123"


// ==== TICKS ====
__xdata volatile uint8_t g_subticks;
__xdata volatile uint32_t g_ticks;
__xdata volatile uint8_t g_leddecr;

void ticks_init()
{
    g_ticks = 0;
    TH0 = 0xf0;
    TL0 = 0xbe;
    TMOD = 1;
    TR0 = 1;
}

void g_rb_out_startsend();
INTERRUPT_USING(timer0_isr, INT_NO_TMR0, 1)
{ // 1024 counts per second
    TH0 = 0xf0;
    TL0 = 0xbe;
    g_subticks = ++g_subticks & 0x07;
    if (g_subticks == 0) {
        ++g_ticks;
        if (g_leddecr) --g_leddecr;
    }
    g_rb_out_startsend();
}

volatile inline uint32_t ticks()
{ // 128 counts per second
    return g_ticks;
}

volatile inline uint32_t seconds()
{
    return (g_ticks >> 7);
}


// ================

#define p3_assert_interrupt()  (P3 &= 0xfb)
#define p3_clear_interrupt()   (P3 |= 4)
#define p3_assert_inact()      (P3 &= 0xfe)
#define p3_clear_inact()       (P3 |= 1)
#define p3_assert_detect()     (P3 &= 0xfd)
#define p3_clear_detect()      (P3 |= 2)

// ================

RingBuf g_rb_out;
uint8_t g_rb_out_sending = 0;

void g_rb_out_startsend()
{
    if (g_rb_out_sending) return;
    if (!RINGBUF_AVAILABLE(&g_rb_out)) return;
    SER1_IER |= bIER_THR_EMPTY;
    g_rb_out_sending = 1;
}

// ================

INTERRUPT_USING(uart1_isr, INT_NO_UART1, 2)
{
    if (!RINGBUF_AVAILABLE(&g_rb_out)) {
        SER1_IER &= ~bIER_THR_EMPTY;
        g_rb_out_sending = 0;
        return;
    }
    p3_clear_inact();
    g_leddecr = 6;
    uint8_t b;
    RINGBUF_READ(&g_rb_out, b);
    UART1SendAsync(b);
}

// ================

char bin2hexchar(uint8_t d)
{
    d &= 0x0f;
    return (d < 10) ? '0' + d : 'a' - 10 + d;
}

uint8_t hexchar2bin(const __xdata char *str)
{
    if (str[0] == 0 || str[1] == 0) return 0;
    uint8_t r = 0;
    for (uint8_t i = 0; i < 2; i++) {
        r <<= 4;
        char c = str[i];
        if ('0' <= c && c <= '9') {
            r |= (c - '0');
        } else if ('a' <= c && c <= 'f') {
            r |= (c - 'a' + 10);
        } else if ('A' <= c && c <= 'F') {
            r |= (c - 'A' + 10);
        }
    }
    return r;
}

#define MAX_NUM_KEYBOARDS 8
int8_t __xdata g_kbd_devIndex[MAX_NUM_KEYBOARDS];
uint8_t __xdata g_kbd_devAddr[MAX_NUM_KEYBOARDS];
uint8_t __xdata g_numKbds;
GamepadState g_state[MAX_NUM_KEYBOARDS];
uint8_t __xdata g_kbd_isXinput[MAX_NUM_KEYBOARDS];
uint8_t __xdata g_kbd_interfNo[MAX_NUM_KEYBOARDS];
uint8_t __xdata g_raw_mode;
uint8_t __xdata g_default_locks;
uint8_t __xdata g_need_poll;

#define kbd_maxcount()           (sizeof(g_kbd_devIndex))
#define kbd_isconnectedat(INDEX) (g_kbd_devIndex[INDEX] >= 0)

int8_t findFreeKbdStateIndex()
{
    for (uint8_t i = 0; i < kbd_maxcount(); i++) {
        if (!kbd_isconnectedat(i)) return i;
    }
    return -1;
}

void usbAttachCallback(uint8_t devIndex, USBDevice *dev, uint8_t is_attach)
{
    DEBUG_OUT("CALLBACK: dev[%d] @%d, is_attach=%d\n", devIndex, dev->address, is_attach);
    p3_clear_interrupt();
    if (is_attach) {
        if (1) { //dev->vid_h == 0x04 || dev->vid_l == 0x5e) {
            int8_t idx = findFreeKbdStateIndex();
            if (idx < 0) {
                DEBUG_OUT("CALLBACK: no more keyboard!\n");
                return;
            }
            g_kbd_devIndex[idx] = devIndex;
            g_kbd_devAddr[idx] = dev->address;
            if (dev->class == 255) {
                DEBUG_OUT("CALLBACK: xinput mode\n");
                g_kbd_isXinput[idx] = 1;
            } else {
                DEBUG_OUT("CALLBACK: normal hid mode\n");
                g_kbd_isXinput[idx] = 0;
            }
            g_kbd_interfNo[idx] = 0;
            for (uint8_t i = 0; i < MAX_INTERFACES_PER_DEVICE; i++) {
                if (dev->iface[i].ep_in) {
                    g_kbd_interfNo[idx] = i;
                    break;
                }
            }
            DEBUG_OUT("CALLBACK: using interf index %d\n", g_kbd_interfNo[idx]);
            gamepad_state_clear(&g_state[idx]);
            g_numKbds++;
            DEBUG_OUT("CALLBACK: %d gamepad(s) now connected\n", g_numKbds);
            uint8_t r = hiddevice_start_input(devIndex, 0);
            DEBUG_OUT("start input: %d\n", r);
        }
    }
#if 0
        for (uint8_t i = 0; i < dev->num_ifaces; i++) {
            DEBUG_OUT("CALLBACK: usage %d\n", dev->iface[i].usage);
            if (dev->vid_h != 0x04 || dev->vid_l != 0x5e) {
                continue;
            }
            /*if (dev->iface[i].usage != Usage_JOYSTICK) {
                continue;
            }*/
            int8_t idx = findFreeKbdStateIndex();
            if (idx < 0) {
                DEBUG_OUT("CALLBACK: no more keyboard!\n");
                return;
            }
            g_kbd_devIndex[idx] = devIndex;
            g_kbd_devAddr[idx] = dev->address;
            //kbdparse_init(&g_kbd[idx]);
            g_numKbds++;
            DEBUG_OUT("CALLBACK: %d keyboard(s) now connected\n", g_numKbds);

            if (g_raw_mode) {
                ringbuf_write(&g_rb_out, bin2hexchar(dev->address >> 4));
                ringbuf_write(&g_rb_out, bin2hexchar(dev->address));
                ringbuf_write(&g_rb_out, 'A');
                ringbuf_write(&g_rb_out, '0');
                ringbuf_write(&g_rb_out, '0');
                ringbuf_write(&g_rb_out, ';');
            }
            uint8_t locks = g_default_locks;
            if (!g_raw_mode || !cfg_separatelock()) for (int8_t k = 0; k < kbd_maxcount(); k++) {
                if (k == idx) continue;
                if (!kbd_isconnectedat(k)) continue;
                locks = g_kbd[k].locks;
                break;
            }
            g_kbd[idx].locks = locks;

            //uint8_t r = hiddevice_start_input(devIndex, Usage_JOYSTICK);
            //DEBUG_OUT("start input: %d\n", r);
        //    setHIDDeviceLED(devIndex, Usage_KEYBOARD, locks);
            if (g_raw_mode) {
                ringbuf_write(&g_rb_out, bin2hexchar(dev->address >> 4));
                ringbuf_write(&g_rb_out, bin2hexchar(dev->address));
                ringbuf_write(&g_rb_out, 'L');
                ringbuf_write(&g_rb_out, '0');
                ringbuf_write(&g_rb_out, bin2hexchar(locks));
                ringbuf_write(&g_rb_out, ';');
            }
            return;
        }
    }
#endif
     else {
        for (uint8_t i = 0; i < kbd_maxcount(); i++) {
            if (g_kbd_devIndex[i] == (int8_t)devIndex) {
                g_kbd_devIndex[i] = -1;
                --g_numKbds;
                DEBUG_OUT("CALLBACK: disconnect, %d keyboard(s) now connected\n", g_numKbds);
                if (g_raw_mode) {
                    ringbuf_write(&g_rb_out, bin2hexchar(dev->address >> 4));
                    ringbuf_write(&g_rb_out, bin2hexchar(dev->address));
                    ringbuf_write(&g_rb_out, 'a');
                    ringbuf_write(&g_rb_out, '0');
                    ringbuf_write(&g_rb_out, '0');
                    ringbuf_write(&g_rb_out, ';');
                }
            }
        }
    }
}

