q61org/CH559_EasyUSBHost/main.c
        if (seconds() != lasthubchecksecs) {
            clear_watchdog();
            checkRootHubConnections();
            checkHubConnections();
            lasthubchecksecs = seconds();
            //g_need_poll = 1;
        }
        if (kbdconnected != (g_numKbds > 0)) {
            kbdconnected = (g_numKbds > 0);
            if (!kbdconnected) {
                p3_clear_detect();
            } else {
                p3_assert_detect();
            }
#if 0
            if (kbdconnected) for (uint8_t i = 0; i < kbd_maxcount(); i++) {
                if (!kbd_isconnectedat(i)) continue;
            }
            spi_update_statusreg(kbdconnected, lk);
#endif
        }

        if (kbd_isconnectedat(targetKbdIndex)) {
            UDevInterface *iface;
            uint8_t devaddr = g_kbd_devAddr[targetKbdIndex];
            static __xdata uint8_t buf[32];
            static uint16_t pollsn = 0;
            uint8_t len = pollHIDDevice(g_kbd_devIndex[targetKbdIndex], g_kbd_interfNo[targetKbdIndex], buf, sizeof(buf), &iface);
            ++pollsn;
            //uint8_t len = pollHIDDevice(g_kbd_devIndex[targetKbdIndex], Usage_JOYSTICK, buf, sizeof(buf), &iface);
            if (len > 0) {
                /*DEBUG_OUT("pollHIDDev %04x @%d [%d] ", pollsn, targetKbdIndex, len);
            	for (uint8_t iii = 0; iii < len; iii++)
	            {
		            DEBUG_OUT("%02X ", buf[iii]);
	            }
                DEBUG_OUT("\n");*/

                uint8_t p3out = 0xfc;
                gamepad_state_clear(&padforled);
                if (g_kbd_isXinput[targetKbdIndex]) {
                    uint8_t k, btnswap;
                    gamepad_parse_hid_data(&iface_xinput, buf, len, &padforled);
                    for (k = 0; k < 4; k++) {
                        btnswap = padforled.btns[8 + k];
                        padforled.btns[8 + k] = padforled.btns[k];
                        padforled.btns[k] = btnswap;
                    }
                } else {
                    gamepad_parse_hid_data(iface, buf, len, &padforled);
                }
                //static GamepadDPad dpad;
                //gamepad_get_unified_dpad(&padforled, &dpad);
                uint8_t unidir = 0;
                if (padforled.unified_dpad.dir.up) {
                    unidir ^= 0x01;
                } else if (padforled.unified_dpad.dir.down) {
                    unidir ^= 0x02;
                }
                if (padforled.unified_dpad.dir.left) {
                    unidir ^= 0x04;
                } else if (padforled.unified_dpad.dir.right) {
                    unidir ^= 0x08;
                }
                p3out ^= (unidir << 2);
                if (padforled.btns[0] != 0) {
                    p3out ^= 0x40;
                }
                if (padforled.btns[1] != 0) {
                    p3out ^= 0x80;
                }
                P3 &= p3out | 3;
                P3 |= p3out;

                //DEBUG_OUT("unidir: %02x, xys: %02x,%02x  %02x,%02x\n", unidir, padforled.xys[0].x, padforled.xys[0].y, padforled.xys[1].x, padforled.xys[1].y);
                if (g_need_poll) {
                    uint8_t i;
                    GamepadState *pad = &g_state[targetKbdIndex];
                    gamepad_state_update(pad, &padforled);

                    ringbuf_write(&g_rb_out, bin2hexchar(devaddr >> 4));
                    ringbuf_write(&g_rb_out, bin2hexchar(devaddr));
                    ringbuf_write(&g_rb_out, 'G');
                    for (uint8_t k = 0; k < 4; k++) {
                        ringbuf_write(&g_rb_out, bin2hexchar(pad->unified_dpad.btn[k] >> 4));
                        ringbuf_write(&g_rb_out, bin2hexchar(pad->unified_dpad.btn[k]));
                    }
                    for (i = 0; i < pad->num_dpads; i++) {
                        ringbuf_write(&g_rb_out, 'H');
                        for (uint8_t k = 0; k < 4; k++) {
                            ringbuf_write(&g_rb_out, bin2hexchar(pad->dpads[i].btn[k] >> 4));
                            ringbuf_write(&g_rb_out, bin2hexchar(pad->dpads[i].btn[k]));
                        }
                    }
                    for (i = 0; i < pad->num_xys; i++) {
                        ringbuf_write(&g_rb_out, 'X');
                        ringbuf_write(&g_rb_out, bin2hexchar(pad->xys[i].x >> 4));
                        ringbuf_write(&g_rb_out, bin2hexchar(pad->xys[i].x));
                        ringbuf_write(&g_rb_out, bin2hexchar(pad->xys[i].y >> 4));
                        ringbuf_write(&g_rb_out, bin2hexchar(pad->xys[i].y));
                    }
                    for (i = 0; i < pad->num_trigs; i++) {
                        ringbuf_write(&g_rb_out, 'T');
                        ringbuf_write(&g_rb_out, bin2hexchar(pad->trigs[i] >> 4));
                        ringbuf_write(&g_rb_out, bin2hexchar(pad->trigs[i]));
                    }
                    ringbuf_write(&g_rb_out, 'N');
                    for (i = 0; i < pad->num_btns; i++) {
                        ringbuf_write(&g_rb_out, bin2hexchar(pad->btns[i] >> 4));
                        ringbuf_write(&g_rb_out, bin2hexchar(pad->btns[i]));
                    }
                    ringbuf_write(&g_rb_out, ';');
                    
#if 0
                    DEBUG_OUT("gamepad:");
                    for (i = 0; i < pad->num_xys; i++) {
                        DEBUG_OUT(" xy[%d]{%x,%x}", i, pad->xys[i].x, pad->xys[i].y);
                    }
                    for (i = 0; i < pad->num_trigs; i++) {
                        DEBUG_OUT(" tr[%d]{%x}", i, pad->trigs[i]);
                    }
                    DEBUG_OUT(" btns");
                    for (i = 0; i < pad->num_btns; i++) {
                        DEBUG_OUT(":%x", pad->btns[i]);
                    }
                    DEBUG_OUT("\n");
#endif
                    g_need_poll = 0;
                }
            }
#if 0
            if (len > 0 && g_need_poll) {
                uint8_t i;
                DEBUG_OUT("pollHIDDev @%d [%d] ", targetKbdIndex, len);
            	for (i = 0; i < len; i++)
	            {
		            DEBUG_OUT("%02X ", buf[i]);
	            }
                DEBUG_OUT("\n");
                GamepadState *pad = &g_state[targetKbdIndex];
                gamepad_parse_hid_data(iface, buf, len, pad);
                DEBUG_OUT("gamepad:");
                for (i = 0; i < pad->num_xys; i++) {
                    DEBUG_OUT(" xy[%d]{%x,%x}", i, pad->xys[i].x, pad->xys[i].y);
                }
                for (i = 0; i < pad->num_trigs; i++) {
                    DEBUG_OUT(" tr[%d]{%x}", i, pad->trigs[i]);
                }
                DEBUG_OUT(" btns");
                for (i = 0; i < pad->num_btns; i++) {
                    DEBUG_OUT(":%x", pad->btns[i]);
                }
                DEBUG_OUT("\n");
                g_need_poll = 0;
            }
#endif
            /*if (len > 0) {
                if (cfg_swapcaps()) kbdparse_hid_swapcaps(buf, len);
                nevts = kbdparse_hidinput(kbd, ticks(), buf, len, evts, 16);
            }
            if (nevts == 0) {
                nevts = kbdparse_getrepeat(kbd, ticks(), cfg_repeat_delay(), cfg_repeat_intvl(), &evts[0]);
            }
            if (nevts > 0) {
                DEBUG_OUT("@%d KeyEvt%3d:", devaddr, nevts);
                for (uint8_t i = 0; i < nevts; i++) {
                    KeyEvent *e = &evts[i];
                    DEBUG_OUT(" %c%02x", (e->evttype == KEYEVENT_REPEAT) ? 'R' : ((e->evttype == KEYEVENT_DOWN) ? 'D' : 'U'), e->keynum);
                    //DEBUG_OUT("** KEY EVT: %s %d %02x\n", (e->evttype == KEYEVENT_REPEAT) ? "REPEAT" : ((e->evttype == KEYEVENT_DOWN) ? "DOWN" : "UP"), e->is_modifier, e->keynum);
                    if (e->evttype == KEYEVENT_DOWN) {
                        if (cfg_intr_keynum() != 0 && e->keynum == cfg_intr_keynum() && e->modifier == cfg_intr_modifier()) {
                            DEBUG_OUT("<INTERRUPT>");
                            p3_assert_interrupt();
                        }
                        uint8_t doUpdateLed = 0;
                        switch (e->keynum) {
                            case 0x53: // numlock
                                if (cfg_dis_numlk()) break;
                                kbd->locks ^= LOCK_NUM;
                                doUpdateLed = 1;
                                break;
                            case 0x39: // caps
                                if (cfg_dis_capslk()) break;
                                kbd->locks ^= LOCK_CAPS;
                                doUpdateLed = 1;
                                break;
                            case 0x47: // scroll
                                if (cfg_dis_scrlk()) break;
                                kbd->locks ^= LOCK_SCROLL;
                                doUpdateLed = 1;
                                break;
                        }
                        if (doUpdateLed) {
                            if (g_raw_mode && cfg_separatelock()) {
                                setHIDDeviceLED(g_kbd_devIndex[targetKbdIndex], Usage_KEYBOARD, kbd->locks);
                            } else {
                                kbd_updatelocks(kbd->locks, 0);
                                spi_update_statusreg(kbdconnected, kbd->locks);
                            }
                            if (g_raw_mode) {
                                ringbuf_write(&g_rb_out, bin2hexchar(devaddr >> 4));
                                ringbuf_write(&g_rb_out, bin2hexchar(devaddr));
                                ringbuf_write(&g_rb_out, 'L');
                                ringbuf_write(&g_rb_out, '0');
                                ringbuf_write(&g_rb_out, bin2hexchar(kbd->locks));
                                ringbuf_write(&g_rb_out, ';');
                            }
                        }
                    } else if (e->evttype == KEYEVENT_UP && cfg_intr_keynum() != 0) {
                        if (e->keynum == cfg_intr_keynum() || e->modifier != cfg_intr_modifier()) {
                            p3_clear_interrupt();
                        }
                    }

