q61org/CH559_EasyUSBHost/main.c
                    static __xdata char charbuf[8];
                    uint8_t cnt = 0;
                    if ((e->evttype == KEYEVENT_DOWN || e->evttype == KEYEVENT_REPEAT) && (e->is_modifier == 0)) {
                        cnt = keymap_keynum_to_char(e->keynum, e->modifier, kbd->locks, charbuf, 8);
                    }

                    if (g_raw_mode) {
                        ringbuf_write(&g_rb_out, bin2hexchar(devaddr >> 4));
                        ringbuf_write(&g_rb_out, bin2hexchar(devaddr));
                        char d = '?';
                        switch (e->evttype) {
                            case KEYEVENT_DOWN: d = (e->is_modifier) ? 'M' : 'K'; break;
                            case KEYEVENT_UP:   d = (e->is_modifier) ? 'm' : 'k'; break;
                            case KEYEVENT_REPEAT: d = 'R'; break;
                        }
                        ringbuf_write(&g_rb_out, d);
                        ringbuf_write(&g_rb_out, bin2hexchar(e->keynum >> 4));
                        ringbuf_write(&g_rb_out, bin2hexchar(e->keynum));
                        if (cnt == 1) {
                            ringbuf_write(&g_rb_out, bin2hexchar(charbuf[0] >> 4));
                            ringbuf_write(&g_rb_out, bin2hexchar(charbuf[0]));
                        }
                        ringbuf_write(&g_rb_out, ';');

                    } else if (cnt == 1 || (cnt > 1 && cfg_ctrlsequence())) {
                        if (cfg_crlf() && cnt == 1 && charbuf[0] == 0x0a) {
                            ringbuf_write(&g_rb_out, 0x0d);
                        }
                        for (uint8_t i = 0; i < cnt; i++) {
                            ringbuf_write(&g_rb_out, charbuf[i]);
                        }
                    }
                }
                DEBUG_OUT("\n");
            }*/
        }
        for (uint8_t i = 0; i < MAX_NUM_KEYBOARDS; i++) {
            if (++targetKbdIndex >= kbd_maxcount()) {
                targetKbdIndex = 0;
            }
            if (kbd_isconnectedat(targetKbdIndex)) break;
        }
        if (g_leddecr == 0) {
            p3_assert_inact();
        }
    }
}
